# Используем официальный образ Golang
FROM golang:1.17-alpine as builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы с зависимостями (go.mod и go.sum)
COPY go.mod go.sum ./

# Скачиваем зависимости
RUN go mod download

# Копируем остальные файлы приложения
COPY . .

# Собираем Go-приложение
RUN go build -o app

# Используем официальный образ Alpine для уменьшения размера
FROM alpine:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем исполняемый файл из первого образа
COPY --from=builder /app/app .

# Указываем порт, который будет прослушивать приложение
EXPOSE 8080

# Команда для запуска приложения при старте контейнера
CMD ["./app"]
